export default[
  {
    id: 1,
    question: "Когда мы начали с тобой встречаться?",
    ans1: {
      text: "29.04.2023",
      res: true,
    },
    ans2: {
      text: "20.03.2023",
      res: 2,
    },
    ans3: {
      text: "26.04.2023",
      res: 3,
    },
  },
  //222222222222222222222222222222222222222
  {
    id: 2,
    question: "После какого моего репититора мы часто гуляли? (Возле первой школы)",
    ans1: {
      text: "Информатика",
      res: 2,
    },
    ans2: {
      text: "Математика",
      res: true,
    },
    ans3: {
      text: "Программирование",
      res: 3,
    },
  },
  //3333333333333333333333333333333333333333
  {
    id: 3,
    question: "С каким вкусом у тебя была гигиеническая помада, когда мы только начали встречаться? Как раз на прогулках после репитов",
    ans1: {
      text: "Кокос",
      res: true,
    },
    ans2: {
      text: "Абрикос",
      res: 2,
    },
    ans3: {
      text: "Ананас",
      res: 3,
    },
  },
  //4444444444444444444444444444444444444444444
  {
    id: 4,
    question: "Какую песню я люблю включать, идя домой от тебя?",
    ans1: {
      text: "Кукла колдуна",
      res: 2,
    },
    ans2: {
      text: "Метафизика",
      res: 3,
    },
    ans3: {
      text: "Забытые ботинки",
      res: true,
    },
  },
  //5555555555555555555555555555555555555555555
  {
    id: 5,
    question: "Где была сделана фотка мжм?",
    ans1: {
      text: "В фикс-прайсе",
      res: 2,
    },
    ans2: {
      text: "На центральном рынке",
      res: true,
    },
    ans3: {
      text: "На въетнамском рынке",
      res: 3,
    },
  },
  //66666666666666666666666666666666666666666666666
  {
    id: 6,
    question: "Кто кого сильнее любит?)",
    ans1: {
      text: "Ниже",
      res: 2,
    },
    ans2: {
      text: "Ещё ниже",
      res: 3,
    },
    ans3: {
      text: "Я тебя)",
      res: true,
    },
  },
  //777777777777777777777777777777777777777777777
  {
    id: 7,
    question: "Каким биологическим термином я тебя иногда называю?",
    ans1: {
      text: "Инфузория",
      res: 2,
    },
    ans2: {
      text: "Тычинка",
      res: 3,
    },
    ans3: {
      text: "Вредная черепашка",
      res: true,
    },
  },
  //88888888888888888888888888888888888888888888888
  {
    id: 8,
    question: "(Вопрос от Маши) Кто разбил ложку на уроке химии?",
    ans1: {
      text: "Андрей",
      res: true,
    },
    ans2: {
      text: "Ты",
      res: 3,
    },
    ans3: {
      text: "Никита",
      res: 2,
    },
  },
  // 99999999999999999999999999999999999999999999999
  {
    id: 9,
    question: "(Вопрос от моей мамы) Как официально зовут нашего кота?",
    ans1: {
      text: "Кай",
      res: true,
    },
    ans2: {
      text: "Рыжий",
      res: 3,
    },
    ans3: {
      text: "Бася",
      res: 2,
    },
  },
  // 1000000000000000000000000000000000000000000000000000
  {
    id: 10,
    question: "(Вопрос от моей мамы) Какая моя любимая книга?",
    ans1: {
      text: "S.T.A.L.K.E.R.",
      res: 2,
    },
    ans2: {
      text: "Метро",
      res: true,
    },
    ans3: {
      text: "Рик и Морти",
      res: 3,
    },
  },
  // 11111111111111111111111111111111111111111111111111111
  {
    id: 11,
    question: "(Вопрос от твоего папы) Какого числа ты пошла в школу?",
    ans1: {
      text: "1 сентября",
      res: 2,
    },
    ans2: {
      text: "9 сентября",
      res: 3,
    },
    ans3: {
      text: "20 сентября",
      res: true,
    },
  },
  // 12222222222222222222222222222222222222222222222
  {
    id: 12,
    question: "(Вопрос от твоей мамы) Что ты научилась делать раньше?",
    ans1: {
      text: "Читать",
      res: true,
    },
    ans2: {
      text: "Считать",
      res: 3,
    },
    ans3: {
      text: "Говорить",
      res: 2,
    },
  },
  // 13333333333333333333333333333333333333333333333
  {
    id: 13,
    question: "(Вопрос от Татьяны Валентиновны) Какое любимое слово было у Руслана?",
    ans1: {
      text: "Море",
      res: 2,
    },
    ans2: {
      text: "Кино",
      res: 3,
    },
    ans3: {
      text: "Пальма",
      res: true,
    },
  },
  // 1444444444444444444444444444444444444444444444444444444444
  {
    id: 14,
    question: "(Вопрос от Тани) Сколько человек изначально было в беседе?",
    ans1: {
      text: "4",
      res: 2,
    },
    ans2: {
      text: "5",
      res: 3,
    },
    ans3: {
      text: "3",
      res: true,
    },
  },
  // 15555555555555555555555555555555555555555555555555555555555555
  {
    id: 15,
    question: "(Вопрос от Тани) Для чего изначально была создана беседа?",
    ans1: {
      text: "Обсуждать одноклассников",
      res: 2,
    },
    ans2: {
      text: "Решить, что дарить на др",
      res: 3,
    },
    ans3: {
      text: "Решение любовной проблемы",
      res: true,
    },
  },
  // 166666666666666666666666666666666666666666666666666666
  {
    id: 16,
    question: "(Вопрос от Никиты) Чью кофту ты надела когда мы с Темычем тебя провожали после того как ты выпила",
    ans1: {
      text: "Тёмыча",
      res: 2,
    },
    ans2: {
      text: "Никитину",
      res: true,
    },
    ans3: {
      text: "Алкоголика дяди Толика",
      res: 3,
    },
  },
  // 17777777777777777777777777777777777777
  {
    id: 17,
    question: "(Вопрос от Никиты) Кто сделал фото на твой телефон которую ты в итоге поставила на аву в вк",
    ans1: {
      text: "Никита",
      res: 2,
    },
    ans2: {
      text: "Артёмка",
      res: true,
    },
    ans3: {
      text: "Сама сделала селфи",
      res: 3,
    },
  },
  // 1888888888888888888888888888888888888888888888888888888
  {
    id: 18,
    question: "(Вопрос от Никиты) Чей подик ты брала чаще",
    ans1: {
      text: "Ты не куришь и вообще ты за ЗОЖ",
      res: 2,
    },
    ans2: {
      text: "Артёмки",
      res: 3,
    },
    ans3: {
      text: "Никиты",
      res: true,
    },
  },
  // 19999999999999999999999999999999999999999999
  {
    id: 19,
    question: "(Вопрос от Никиты) Кто обгорел на солнце когда мы катались на великах",
    ans1: {
      text: "Твоя спина",
      res: true,
    },
    ans2: {
      text: "Волосы Тёмыча на ногах",
      res: 3,
    },
    ans3: {
      text: "Руки Никиты",
      res: 2,
    },
  },
  // 200000000000000000000000000000000000000000000000
]