<template>
  <div>
    <Header />
    <p class="text">
      Больше Без тебя я жизнь не представляю, <br>
      Просто тону, я просто утопаю. <br>
      Я не хочу жить так, как жил прежде. <br>
      Дай же мне сердце, немного согреться. <br>
      Отныне Без тебя, в душе моей вьюга, <br>
      Разум без тебя, как север без юга. <br>
      Иногда мы вздорим, но по-факту все мелочь. <br>
      Возьми мою руку и пойдем в неизвестность.
    </p>
    <p class="text">
      Те <span v-if="!toggle">4</span><u class="code" v-if="toggle">4</u> месяца, что поглотила учеба, <br>
      Длились так долго, что я уже был измотан. <br>
      И как же мне жаль, что моменты совместные, <br>
      Уже не такие частые, но от того они интереснее. <br>
    </p>
    <p class="text">
      Хочется тебе сказать, <br>
      Что не брошу я тебя. <br>
      Буду лучшим мужем, знай <br>
      Только мне пообещай, <br>
      Мне так нужно от тебя, <br>
      Любви куча и тепла. <br>
      А если нужно подтвердить, <br>
      Могу сердце предоставить.
    </p>
    <p class="text">
      В моей памяти все дни, когда с тобою рядом. <br>
      Чувства говорят, что это все взаправду. <br>
      Нам с тобой не страшны никакие невзгоды. <br>
      Ссоры это глупости, они того не стоят. <br>
      Помнишь, как с тобой после школы гуляли? <br>
      А как в Зайцев дома у меня играли? <br>
      Все воспоминания со мною навечно, <br>
      Они все время рядом, где-то в мышце сердечной.
    </p>
    <p class="text">
      Оглянуться не успеем, и скоро уже год. <br>
      <span v-if="!toggle">1</span><u class="code" v-if="toggle">1</u> год это с тобой вместе, уже прям вот-вот. <br>
      Впереди еще много чего вместе пройдем, <br>
      Главное, чтобы рядом, главное - вдвоем.
    </p>
    <p class="text">
      Я запомнил первый наш с тобой танец <br>
      Хоть он был безумен, я не иностранец. <br>
      Иногда так хочется в лепешку разбиться, <br>
      Чтобы со мной рядом смогла снова влюбиться. <br>
      Ни за что и никогда тебя не обижу, <br>
      Но и ты все говори, ведь я же все вижу. <br>
      В сердце моем ты вечно живи, <br>
      Ты мой лучик солнца, ты мой мотив. &lt;<u class="code" v-if="toggle">3</u><span v-if="!toggle">3</span>
    </p>
    <p class="text text__descr">P.s. Именно это и должен был быть мой главный сюрприз. Я хотел попробовать спеть это. Эти стихи я писал под инструментал и хотел попробовать исполнить их, но если ты это читаешь, то значит у меня ничего не вышло(
Может быть однажды…</p>
    <p class="text text__descr">С днем рождения тебя солнце, я люблю тебя. Ищи то, за чем пришла тут, в стихотворении. Удачи)</p>
    <p class="text text__descr">Только аккуратно открывай замок. Я немного не рассчитал габариты и поэтому крышка чуть выпирает. Слегка придави ее в области замка и проворачивай, когда введешь пароль.</p>
    <button @click="toggle = true" class="btn">Подскаазка</button>
  </div>
</template>

<script lang="ts">
import Header from '@/components/header.vue';
import { defineComponent } from 'vue';

export default defineComponent({
  components: {
    Header
  },

  data() {
      return {
        toggle: false
      }
  },
})
</script>

<style>
.text {
  /* width: 460px; */
  color: white;
  text-align: left;
  margin-bottom: 20px;
}
.btn {
  background-color: #B757F1;
  padding: 10px;
  border: none;
  border-radius: 10px;
  color: white;
}
.code {
  color: rgb(255, 0, 0);
}
</style>